src/cf/InformationRegisters/ItobПривязкиТрекеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ItobПривязкиТрекеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТерминалУстановлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobТерминалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ItobОбъектМониторинга</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ItobАктуальностьДанныхТерминалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ItobАктуальностьДанныхТерминалов</Name>
			<Comment>Актуальность данных терминалов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиротаДействияРазрешеннойСкорости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолготаДействияРазрешеннойСкорости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скорость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеннаяСкоростьПоПДД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктуальностьИтогов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеДатчиков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайниеТочки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГруппировки0</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВидыГруппировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГруппировки1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВидыГруппировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГруппировки2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВидыГруппировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГруппировки3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВидыГруппировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГруппировки4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВидыГруппировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГруппировки5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВидыГруппировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГруппировки6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВидыГруппировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГруппировки7</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВидыГруппировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГруппировки8</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВидыГруппировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГруппировки9</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВидыГруппировок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодходящийВариантДинамическогоОформления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВариантыДинамическогоОформления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодходящийВариантДинамическогоОформленияПриЗадержкеДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobВариантыДинамическогоОформления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobТерминалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ItobИнтерфейсДанныхМониторинга/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДанныеМониторингаПодвижныхОбъектов

// Позволяет получить данные по маршрутам объектов мониторинга за определенный период времени в виде таблицы значений.
// Состав колонок возвращаемой таблицы см. в ItobОперативныйМониторинг.СоздатьТаблицуЗначенийМаршрутОбъектаМониторинга, 
// так же в таблице добавляется колонка "ОбъектМониторинга". Данные берутся не из ИБ, а из IMCS через http запрос.
//	
// Параметры:
//  ОбъектыМониторинга	 - Массив из ОпределяемыйТип.ItobОбъектМониторинга	 - Массив ссылок на объекты мониторинга.
//  ПериодС				 - Дата	 - Период начала маршрута.
//  ПериодПо			 - Дата	 - Период окончания маршрута.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Маршруты объектов мониторинга 
//
Функция МаршрутыОбъектовПоДаннымМониторинга(ОбъектыМониторинга, ПериодС, ПериодПо) Экспорт
	
	ДанныеОбъектовМониторинга = Неопределено;
	Для каждого Объект Из ОбъектыМониторинга Цикл
		Если ДанныеОбъектовМониторинга = Неопределено Тогда
			ДанныеОбъектовМониторинга = МаршрутОбъектаПоДаннымМониторинга(Объект, ПериодС, ПериодПо);
		ИначеЕсли ТипЗнч(ДанныеОбъектовМониторинга) = Тип("ТаблицаЗначений") Тогда  
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(МаршрутОбъектаПоДаннымМониторинга(Объект, ПериодС, ПериодПо), 
														  ДанныеОбъектовМониторинга);
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат ДанныеОбъектовМониторинга;
	
КонецФункции

// Позволяет получить данные по маршруту объекта мониторинга за определенный период времени в виде таблицы значений.
// Состав колонок возвращаемой таблицы см. в ItobОперативныйМониторинг.СоздатьТаблицуЗначенийМаршрутОбъектаМониторинга, 
// так же в таблице добавляется колонка "ОбъектМониторинга". Данные берутся не из ИБ, а из IMCS через http запрос.
//	
// Параметры:
//  ОбъектМониторинга	 - ОпределяемыйТип.ItobОбъектМониторинга - ссылка на объект мониторинга.
//  ПериодС				 - Дата	 - Период начала маршрута.
//  ПериодПо			 - Дата	 - Период окончания маршрута.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Маршрут объекта мониторинга 
//
Функция МаршрутОбъектаПоДаннымМониторинга(ОбъектМониторинга, ПериодС, ПериодПо) Экспорт
	
	ДанныеОбъектаМониторинга = ItobОперативныйМониторинг.СформироватьМаршрутОбъектаМониторинга(ОбъектМониторинга, ПериодС, ПериодПо);

	Если ТипЗнч(ДанныеОбъектаМониторинга) = Тип("ТаблицаЗначений") Тогда
		ДанныеОбъектаМониторинга.Колонки.Добавить("ОбъектМониторинга");
		ДанныеОбъектаМониторинга.ЗаполнитьЗначения(ОбъектМониторинга, "ОбъектМониторинга");
	КонецЕсли; 
	
	Возврат ДанныеОбъектаМониторинга
	
КонецФункции

// Актуальные данные терминалов, привязанных к объектам мониторинга на текущую дату сеанса (данные будут получены из ИБ)
// 
// Параметры:
//  ОбъектыМониторинга	 - Массив из ОпределяемыйТип.ItobОбъектМониторинга	 - Массив ссылок на объекты мониторинга.
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция АктуальныеДанныеТерминаловОбъектовМониторинга (ОбъектыМониторинга) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СдвигВремени", ItobОперативныйМониторинг.ПолучитьПараметрыСдвигаВремени().СдвигВремени);
	Запрос.УстановитьПараметр("ОбъектыМониторинга", ОбъектыМониторинга);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ItobАктуальностьДанныхТерминалов.Терминал КАК Терминал,
	|	ItobАктуальностьДанныхТерминалов.ДатаВремя КАК ПериодUTC0,
	|	ДОБАВИТЬКДАТЕ(ItobАктуальностьДанныхТерминалов.ДатаВремя, СЕКУНДА, &СдвигВремени) КАК Период,
	|	ItobАктуальностьДанныхТерминалов.Широта КАК Широта,
	|	ItobАктуальностьДанныхТерминалов.Долгота КАК Долгота,
	|	ItobАктуальностьДанныхТерминалов.Скорость КАК Скорость,
	|	ItobАктуальностьДанныхТерминалов.Направление КАК Направление,
	|	ItobАктуальностьДанныхТерминалов.ВидГруппировки0 КАК ВидГруппировки0,
	|	ItobАктуальностьДанныхТерминалов.ВидГруппировки1 КАК ВидГруппировки1,
	|	ItobАктуальностьДанныхТерминалов.ВидГруппировки2 КАК ВидГруппировки2,
	|	ItobАктуальностьДанныхТерминалов.ВидГруппировки3 КАК ВидГруппировки3,
	|	ItobАктуальностьДанныхТерминалов.ВидГруппировки4 КАК ВидГруппировки4,
	|	ItobАктуальностьДанныхТерминалов.ВидГруппировки5 КАК ВидГруппировки5,
	|	ItobАктуальностьДанныхТерминалов.ВидГруппировки6 КАК ВидГруппировки6,
	|	ItobАктуальностьДанныхТерминалов.ВидГруппировки7 КАК ВидГруппировки7,
	|	ItobАктуальностьДанныхТерминалов.ВидГруппировки8 КАК ВидГруппировки8,
	|	ItobАктуальностьДанныхТерминалов.ВидГруппировки9 КАК ВидГруппировки9,
	|	ItobАктуальностьДанныхТерминалов.ДанныеДатчиков КАК ДанныеДатчиков,
	|	ItobАктуальностьДанныхТерминалов.КрайниеТочки КАК КрайниеТочки,
	|	ItobАктуальностьДанныхТерминалов.ПодходящийВариантДинамическогоОформления КАК ПодходящийВариантДинамическогоОформления,
	|	ItobПривязкиТрекеровСрезПоследних.Объект КАК Объект,
	|	ItobАктуальностьДанныхТерминалов.ПодходящийВариантДинамическогоОформленияПриЗадержкеДанных КАК ПодходящийВариантДинамическогоОформленияПриЗадержкеДанных
	|ИЗ
	|	РегистрСведений.ItobПривязкиТрекеров.СрезПоследних(, Объект В (&ОбъектыМониторинга)) КАК ItobПривязкиТрекеровСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ItobАктуальностьДанныхТерминалов КАК ItobАктуальностьДанныхТерминалов
	|		ПО ItobПривязкиТрекеровСрезПоследних.Терминал = ItobАктуальностьДанныхТерминалов.Терминал";

	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Актуальные данные терминала, привязанного к объекту мониторинга на текущую дату сеанса (данные будут получены из ИБ)
// 
// Параметры:
//  ОбъектМониторинга -  ОпределяемыйТип.ItobОбъектМониторинга	 - ссылка на объект мониторинга.
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция АктуальныеДанныеТерминалаОбъектаМониторинга(ОбъектМониторинга) Экспорт
		
	ОбъектыМониторинга = Новый Массив;
	ОбъектыМониторинга.Добавить(ОбъектМониторинга);

	Возврат АктуальныеДанныеТерминаловОбъектовМониторинга(ОбъектыМониторинга);
	
КонецФункции

// Сводные данные о движении объекта мониторинга
//
// Параметры:
//  ОбъектМониторинга	 - СправочникСсылка
//  ПериодНачало		 - Дата
//  ПериодОкончание		 - Дата
//  ТекстОшибки			 - Строка
//
// Возвращаемое значение:
//  Структура - Данные по ТС включающие в себя:
//		*ПробегGPS - Число
//		*ПробегCAN - Число
//		*СпидометрВыездаCAN - Число
//		*СпидометрВозвращенияCAN - Число
//		*ВремяРаботыДвигателя - Число
//		*ВремяВДвиженииСВклДВС - Число
//		*ВремяВПростоеСВклДВС - Число
//
Функция СводныеДанныеОДвиженииОбъектаМониторинга(ОбъектМониторинга, ПериодНачало, ПериодОкончание, ТекстОшибки = "") Экспорт
	
	ПолучатьДанныеТоплива = Ложь;
	Параметры = ПараметрыПолученияДанныхОбъектаМониторинга(ОбъектМониторинга, ПериодНачало, ПериодОкончание, ПолучатьДанныеТоплива); 
		
	СводныеДанные = ItobЗаполнениеПоДаннымТрекеров.ПолучитьДанныеПоТС_Локально(Параметры.Основные, ТекстОшибки, Параметры.ПараметрыЗаполнения);
	
	Возврат СводныеДанные;
	
КонецФункции

// Сводные данные о движении и расходе топлива объекта мониторинга
//
// Параметры:
//  ОбъектМониторинга	 - СправочникСсылка
//  ПериодНачало		 - Дата
//  ПериодОкончание		 - Дата
//  ТекстОшибки			 - Строка
//
// Возвращаемое значение:
//  Структура - Данные по ТС включающие в себя:
//		*ПробегGPS - Число
//		*ПробегCAN - Число
//		*СпидометрВыездаCAN - Число
//		*СпидометрВозвращенияCAN - Число
//		*ВремяРаботыДвигателя - Число
//		*УровеньТопливаНачало - Число
//		*УровеньТопливаКонец - Число
//		*РасходТоплива - Число
//		*ОбъемЗаправок - Число
//		*ВремяВДвиженииСВклДВС - Число
//		*ВремяВПростоеСВклДВС - Число
//
Функция СводныеДанныеОДвиженииИРасходеТопливаОбъектаМониторинга(ОбъектМониторинга, ПериодНачало, ПериодОкончание, ТекстОшибки = "") Экспорт
	
	ПолучатьДанныеТоплива = Истина;
	Параметры = ПараметрыПолученияДанныхОбъектаМониторинга(ОбъектМониторинга, ПериодНачало, ПериодОкончание, ПолучатьДанныеТоплива); 
	
	СводныеДанные = ItobЗаполнениеПоДаннымТрекеров.ПолучитьДанныеПоТС_Локально(Параметры.Основные, ТекстОшибки, Параметры.ПараметрыЗаполнения);
	
	Возврат СводныеДанные;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыПолученияДанныхОбъектаМониторинга(ОбъектМониторинга, ПериодНачало, ПериодОкончание, ЗаполнятьУровеньБака)
	
	ОсновныеПараметры = Новый Структура;
	ОсновныеПараметры.Вставить("ТранспортноеСредство", ОбъектМониторинга);
	ОсновныеПараметры.Вставить("ДатаВыезда", ПериодНачало);
	ОсновныеПараметры.Вставить("ДатаВозвращения", ПериодОкончание);

	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ЗаполнятьОдометрПоПробегуGPS", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнятьУровеньБака", ЗаполнятьУровеньБака);
	
	
	Возврат Новый Структура("Основные, ПараметрыЗаполнения", ОсновныеПараметры, ПараметрыЗаполнения);
	
КонецФункции
 
#КонецОбласти 

#КонецОбласти
